package com.STHY.sthyworks.common.block.specialShapesBase;

public final class BlockShapes {

    public static final float[][] EGG = {
        {0.25F, 0.0F, 0.25F, 0.75F, 0.0625F, 0.75F},
        {0.1875F, 0.0625F, 0.1875F, 0.8125F, 0.25F, 0.8125F},
        {0.125F, 0.25F, 0.125F, 0.875F, 0.4375F, 0.875F},
        {0.0625F, 0.4375F, 0.0625F, 0.9375F, 0.625F, 0.9375F},
        {0.125F, 0.625F, 0.125F, 0.875F, 0.8125F, 0.875F},
        {0.1875F, 0.8125F, 0.1875F, 0.8125F, 0.9375F, 0.8125F},
        {0.25F, 0.9375F, 0.25F, 0.75F, 1.0F, 0.75F}
    };

    public static final float[][] TABLE = {
        {0.0F, 0.75F, 0.0F, 1.0F, 1.0F, 1.0F},
        {0.125F, 0.0F, 0.125F, 0.25F, 0.75F, 0.25F},
        {0.75F, 0.0F, 0.125F, 0.875F, 0.75F, 0.25F},
        {0.125F, 0.0F, 0.75F, 0.25F, 0.75F, 0.875F},
        {0.75F, 0.0F, 0.75F, 0.875F, 0.75F, 0.875F}
    };

    public static final float[][] RITUAL_TABLE = {
        { 0.0F, 0.0F, 0.0F, 1.0F, 0.125F, 1.0F},
        { 0.125F, 0.125F, 0.125F, 0.875F, 0.25F, 0.875F},
        { 0.0F, 0.125F, 0.0F, 0.125F, 0.75F, 0.125F},//柱子
        { 0.875F, 0.125F, 0.0F, 1.0F, 0.75F, 0.125F},//柱子
        { 0.0F, 0.125F, 0.875F, 0.125F, 0.75F, 1.0F},//柱子
        { 0.875F, 0.125F, 0.875F, 1.0F, 0.75F, 1.0F},//柱子
    };
    private BlockShapes() {
    }
}
